[
    {
    "fever": {
        "clarifying_questions": [
            "How long have you had the fever?",
            "What is the highest temperature you've recorded?",
            "Do you have other symptoms like chills, cough, sore throat, or rash?",
            "Have you recently traveled or been exposed to someone who is ill?",
            "Are you taking any medications that could cause fever?",
            "Do you have any existing medical conditions such as immune suppression?"
        ],
        "conditions_to_flag": [
            "Fever above 103°F (39.4°C)",
            "Fever lasting more than 3 days",
            "Fever with severe headache or stiff neck",
            "Fever with rash",
            "Fever with breathing difficulty or chest pain",
            "Fever with confusion or altered mental status",
            "Fever in an infant younger than 3 months"
        ],
        "triage_recommendations": {
            "emergency": "Seek emergency care if the fever is above 103°F, or is accompanied by confusion, difficulty breathing, stiff neck, persistent vomiting, or chest pain.",
            "doctor_visit": "Consult a doctor if the fever lasts more than 3 days, or is accompanied by a rash, sore throat, headache, or signs of dehydration.",
            "monitor_at_home": "Monitor at home if the fever is mild (below 102°F), and not associated with severe symptoms. Rest, hydrate, and use fever-reducing medication if needed."
        },
        "safe_advice": "Take acetaminophen or ibuprofen to reduce the fever. Stay hydrated, get plenty of rest, and dress in lightweight clothing. Avoid over-bundling. Seek medical attention if symptoms worsen or persist."
        }
    },

    {
        "sinus_headache": {
            "clarifying_questions": [
                "How long have you been experiencing headaches?",
                "Do you have nasal congestion or discharge?",
                "Is there facial pain or pressure, particularly around the eyes, cheeks, nose, or forehead?",
                "Have you had any recent upper respiratory infections or allergies?",
                "Do your symptoms worsen when bending forward or lying down?",
                "Are you experiencing fever or swelling around the eyes?"
            ],
            "conditions_to_flag": [
                "Headache accompanied by high fever",
                "Severe facial swelling or redness around the eyes",
                "Visual disturbances or double vision",
                "Confusion or difficulty concentrating",
                "Headache persisting beyond 10 days without improvement",
                "History of recurrent sinus infections"
            ],
            "triage_recommendations": {
                "emergency": "Seek immediate medical attention if you experience a high fever, severe facial swelling, visual disturbances, or confusion.",
                "doctor_visit": "Consult a healthcare provider if symptoms persist beyond 10 days, worsen after initial improvement, or are accompanied by fever.",
                "monitor_at_home": "For mild symptoms, manage with rest, hydration, over-the-counter pain relievers, and saline nasal sprays."
            },
            "safe_advice": "To alleviate sinus headache symptoms, use saline nasal rinses, apply warm compresses to the affected areas, stay hydrated, and consider using a humidifier to moisten the air. Over-the-counter decongestants or pain relievers may also provide relief, but use them as directed and consult a healthcare provider if symptoms persist or worsen."
        }
    },

    {
        "chest_pain": {
            "clarifying_questions": [
                "Is the pain sharp, dull, or pressure-like?",
                "Does the pain radiate to your arm, neck, or jaw?",
                "Do you have shortness of breath, sweating, or nausea?",
                "Have you experienced similar pain before?",
                "Are you currently taking any medications for heart conditions?",
                "Do you have a history of heart disease or risk factors such as smoking, high blood pressure, or diabetes?"
            ],
            "conditions_to_flag": [
                "Chest pain with shortness of breath or nausea may indicate a heart attack.",
                "Sudden, severe chest pain could be a medical emergency."
            ],
            "triage_recommendations": {
                "emergency": "Yes, if pain is severe, spreading, or accompanied by shortness of breath or nausea.",
                "doctor_visit": "If the pain is mild or persistent but not associated with red flag symptoms.",
                "monitor_at_home": "Only if mild and previously evaluated, and no worsening symptoms."
            },
            "safe_advice": "If in doubt, seek immediate medical help. Do not ignore chest pain that feels unusual or intense."
        }
    },

    {
        "rash": {
            "clarifying_questions": [
                "Is the rash spreading quickly?",
                "Do you have a fever or swelling?",
                "Is the rash painful or oozing?",
                "Have you recently started any new medications?",
                "Do you have a history of allergies or skin conditions?"
            ],
            "conditions_to_flag": [
                "Rash with fever may indicate an infection.",
                "Rapidly spreading or painful rashes may require urgent attention."
            ],
            "triage_recommendations": {
                "emergency": "If rash is spreading quickly, accompanied by fever, or signs of an allergic reaction (e.g. swelling, difficulty breathing).",
                "doctor_visit": "If the rash is painful, persistent, or getting worse over a few days.",
                "monitor_at_home": "If it's mild, not spreading, and not associated with other symptoms."
            },
            "safe_advice": "Use mild skincare products. Monitor for worsening. If new symptoms appear, contact a healthcare provider."
        }
    },
    {
        "sinus_headache": {
            "clarifying_questions": [
                "How long have you been experiencing headaches?",
                "Do you have nasal congestion or discharge?",
                "Is there facial pain or pressure, particularly around the eyes, cheeks, nose, or forehead?",
                "Have you had any recent upper respiratory infections or allergies?",
                "Do your symptoms worsen when bending forward or lying down?",
                "Are you experiencing fever or swelling around the eyes?"
            ],
            "conditions_to_flag": [
                "Headache accompanied by high fever",
                "Severe facial swelling or redness around the eyes",
                "Visual disturbances or double vision",
                "Confusion or difficulty concentrating",
                "Headache persisting beyond 10 days without improvement",
                "History of recurrent sinus infections"
            ],
            "triage_recommendations": {
                "emergency": "Seek immediate medical attention if you experience a high fever, severe facial swelling, visual disturbances, or confusion.",
                "doctor_visit": "Consult a healthcare provider if symptoms persist beyond 10 days, worsen after initial improvement, or are accompanied by fever.",
                "monitor_at_home": "For mild symptoms, manage with rest, hydration, over-the-counter pain relievers, and saline nasal sprays."
            },
            "safe_advice": "To alleviate sinus headache symptoms, use saline nasal rinses, apply warm compresses to the affected areas, stay hydrated, and consider using a humidifier to moisten the air. Over-the-counter decongestants or pain relievers may also provide relief, but use them as directed and consult a healthcare provider if symptoms persist or worsen."
        }
    }
    
]


